# Pandas Apply Functions
* Sometimes, pre-built Pandas functions are not enough, and therefore, it's important to know how to apply your own functions to Pandas objects

To apply your own library's functions, or another libraryâ€™s functions to Pandas objects, you should be aware of the methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, or row- or column-wise.

- tablewise function application: pipe()
- row or column-wise function application: apply()

### Tablewise function application
- DataFrames and Series can be passed into functions without any problems.

In [6]:
import pandas as pd, numpy as np



def extract_city_name(df):
    """
    Chicago, IL -> Chicago for city_name column
    """
    df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
    return df

In [4]:
def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-US for city_name column
    """
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

In [7]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

In [8]:
df_p

  city_and_code
0   Chicago, IL

### Row or Column-wise Function Application
- Arbitrary functions can be applied along the axes of a DataFrame using the apply() method, which, like the descriptive statistics methods, takes an optional axis argument.

In [9]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [10]:
df.apply(np.mean)

one     -0.156810
two     -0.435600
three   -0.093909
dtype: float64

In [11]:
df.apply(np.mean, axis=1)

a   -0.355297
b   -0.715976
c    0.159838
d   -0.057774
dtype: float64

In [12]:
df.apply(lambda x: x.max() - x.min())

one      1.940241
two      2.711272
three    1.957721
dtype: float64

In [13]:
df.apply(np.cumsum)

        one       two     three
a  0.146985 -0.857580       NaN
b -1.131843 -2.683907  0.957228
c -0.470431 -2.627343  0.718765
d       NaN -1.742398 -0.281727

In [14]:
df.apply(np.exp)

        one       two     three
a  1.158336  0.424188       NaN
b  0.278363  0.161004  2.604467
c  1.937527  1.058194  0.787838
d       NaN  2.422852  0.367698

- You can use apply() to apply your own function:

In [15]:
def own_function(x):
    return x*x
df.apply(own_function)

        one       two     three
a  0.021605  0.735443       NaN
b  1.635402  3.335471  0.916286
c  0.437467  0.003199  0.056865
d       NaN  0.783128  1.000985

- You may also pass additional arguments and keyword arguments to the apply() method. For instance, consider the following function you would like to apply:

In [16]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [18]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.617672 -1.952527       NaN
b -2.092943 -2.275442 -1.347591
c -1.446196 -1.647812 -1.746154
d       NaN -1.371685 -2.000164

```Note: args has to be iterable. Therefore, even if you pass only 1 argument, you have to pass it as a tuple:

args=(5,)```

In [19]:
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -4.853015 -5.857580       NaN
b -6.278828 -6.826327 -4.042772
c -4.338587 -4.943437 -5.238463
d       NaN -4.115055 -6.000493